noless-zz/esp8266-led-strip-clock/src/main.cpp
/*
 * ESP8266 WS2812 LED Controller with Captive Portal & OTA
 * --------------------------------------------------------
 * - Captive WiFi hotspot with web UI
 * - WS2812 LED chain control (65 LEDs)
 * - OTA firmware update over WiFi
 * - Multiple LED effects & color control
 */

#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <ESPAsyncWebServer.h>
#include <ESPAsyncTCP.h>
#include <DNSServer.h>
#include <ArduinoJson.h>
#include <ArduinoOTA.h>
#include <ESP8266mDNS.h>
#include <FastLED.h>
#include <Updater.h>

// ─── Configuration ───────────────────────────────────────
#ifndef NUM_LEDS
#define NUM_LEDS 65
#endif
#ifndef LED_PIN
#define LED_PIN D4
#endif

const char* AP_SSID_BASE = "LED-Controller";
const char* AP_PASS     = "";          // Open network for captive portal
const char* OTA_PASS    = "admin123";  // OTA & upload password
const byte  DNS_PORT    = 53;

// ─── Globals ─────────────────────────────────────────────
CRGB leds[NUM_LEDS];
AsyncWebServer server(80);
DNSServer dnsServer;
String deviceId;
String apSsid;
String localHostname;
bool mdnsStarted = false;

// LED State
struct LedState {
  bool     power       = true;
  uint8_t  brightness  = 128;
  uint8_t  effect      = 0;   // 0=solid,1=rainbow,2=chase,3=breathe,4=fire,5=twinkle,6=wave,7=gradient
  CRGB     color1      = CRGB(255, 0, 80);
  CRGB     color2      = CRGB(0, 120, 255);
  uint8_t  speed       = 128;
} state;

uint8_t effectHue = 0;
unsigned long lastUpdate = 0;

// ─── Forward Declarations ────────────────────────────────
void setupWiFi();
void setupDNS();
void setupMDNS();
void setupOTA();
void setupWebServer();
void setupLEDs();
void updateLEDs();
void effectSolid();
void effectRainbow();
void effectChase();
void effectBreathe();
void effectFire();
void effectTwinkle();
void effectWave();
void effectGradient();
String getStatusJson();
String getWifiScanJson();
void buildDeviceIdentity();
bool connectToWiFi(const String& ssid, const String& pass);

// ─── HTML Page (embedded) ────────────────────────────────
const char INDEX_HTML[] PROGMEM = R"rawliteral(
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0, user-scalable=no">
<title>LED Controller</title>
<style>
  @import url('https://fonts.googleapis.com/css2?family=JetBrains+Mono:wght@300;400;600&display=swap');
  :root {
    --bg: #0a0a0f;
    --card: #12121a;
    --border: #1e1e2e;
    --text: #e0e0e8;
    --dim: #6a6a7a;
    --accent: #ff0050;
    --accent2: #0078ff;
    --glow: rgba(255,0,80,0.3);
  }
  * { margin:0; padding:0; box-sizing:border-box; }
  body {
    font-family: 'JetBrains Mono', monospace;
    background: var(--bg);
    color: var(--text);
    min-height: 100vh;
    padding: 16px;
    -webkit-font-smoothing: antialiased;
  }
  .container { max-width: 420px; margin: 0 auto; }
  h1 {
    font-size: 1.1rem;
    font-weight: 600;
    letter-spacing: 2px;
    text-transform: uppercase;
    text-align: center;
    margin-bottom: 20px;
    background: linear-gradient(135deg, var(--accent), var(--accent2));
    -webkit-background-clip: text;
    -webkit-text-fill-color: transparent;
  }
  .card {
    background: var(--card);
    border: 1px solid var(--border);
    border-radius: 12px;
    padding: 16px;
    margin-bottom: 12px;
  }
  .card-title {
    font-size: 0.65rem;
    letter-spacing: 3px;
    text-transform: uppercase;
    color: var(--dim);
    margin-bottom: 12px;
  }
  .power-row {
    display: flex;
    align-items: center;
    justify-content: space-between;
  }
  .led-preview {
    height: 6px;
    border-radius: 3px;
    background: linear-gradient(90deg, var(--accent), var(--accent2), var(--accent));
    background-size: 200% 100%;
    animation: shimmer 3s ease infinite;
    margin-bottom: 16px;
    opacity: 0.8;
  }
  @keyframes shimmer { 0%,100%{background-position:0% 50%} 50%{background-position:100% 50%} }
  .toggle {
    width: 48px; height: 26px;
    background: #2a2a3a;
    border-radius: 13px;
    position: relative;
    cursor: pointer;
    transition: background 0.3s;
  }
  .toggle.on { background: var(--accent); box-shadow: 0 0 12px var(--glow); }
  .toggle::after {
    content: '';
    width: 20px; height: 20px;
    background: #fff;
    border-radius: 50%;
    position: absolute;
    top: 3px; left: 3px;
    transition: transform 0.3s;
  }
  .toggle.on::after { transform: translateX(22px); }
  .slider-group { margin-bottom: 14px; }
  .slider-label {
    display: flex;
    justify-content: space-between;
    font-size: 0.7rem;
    color: var(--dim);
    margin-bottom: 6px;
  }
  input[type=range] {
    -webkit-appearance: none;
    width: 100%;
    height: 4px;
    border-radius: 2px;
    background: #2a2a3a;
    outline: none;
  }
  input[type=range]::-webkit-slider-thumb {
    -webkit-appearance: none;
    width: 18px; height: 18px;
    border-radius: 50%;
    background: var(--accent);
    cursor: pointer;
    box-shadow: 0 0 8px var(--glow);
  }
  .color-row {
    display: flex;
    gap: 12px;
    align-items: center;
  }
  .color-pick {
    flex: 1;
    display: flex;
    flex-direction: column;
    align-items: center;
    gap: 6px;
  }
  .color-pick label { font-size: 0.6rem; color: var(--dim); letter-spacing: 1px; }
  input[type=color] {
    -webkit-appearance: none;
    width: 100%; height: 36px;
    border: 1px solid var(--border);
    border-radius: 8px;
    background: transparent;
    cursor: pointer;
    padding: 2px;
  }
  input[type=color]::-webkit-color-swatch-wrapper { padding: 0; }
  input[type=color]::-webkit-color-swatch { border: none; border-radius: 6px; }
  .effects-grid {
    display: grid;
    grid-template-columns: repeat(4, 1fr);
    gap: 6px;
  }
  .fx-btn {
    padding: 8px 4px;
    font-family: inherit;
    font-size: 0.6rem;
    letter-spacing: 0.5px;
    background: #1a1a2a;
    border: 1px solid var(--border);
    border-radius: 8px;
    color: var(--dim);
    cursor: pointer;
    transition: all 0.2s;
    text-align: center;
  }
  .fx-btn:hover { border-color: var(--accent); color: var(--text); }
  .fx-btn.active {
    background: linear-gradient(135deg, rgba(255,0,80,0.15), rgba(0,120,255,0.15));
    border-color: var(--accent);
    color: #fff;
    box-shadow: 0 0 8px var(--glow);
  }
  .upload-area {
    border: 1px dashed var(--border);
    border-radius: 8px;
    padding: 16px;
    text-align: center;
    cursor: pointer;
    transition: border-color 0.3s;
  }
  .upload-area:hover { border-color: var(--accent); }
  .upload-area p { font-size: 0.7rem; color: var(--dim); }
  .upload-btn {
    display: inline-block;
    margin-top: 10px;
    padding: 8px 20px;
    font-family: inherit;
    font-size: 0.7rem;
    background: var(--accent);
    color: #fff;
    border: none;
    border-radius: 6px;
    cursor: pointer;
    letter-spacing: 1px;
  }
  .upload-btn:disabled { opacity: 0.4; cursor: not-allowed; }
  .progress-bar {
    width: 100%;
    height: 4px;
    background: #2a2a3a;
    border-radius: 2px;
    margin-top: 10px;
    display: none;
  }
  .progress-fill {
    height: 100%;
    background: var(--accent);
    border-radius: 2px;
    width: 0%;
    transition: width 0.3s;
  }
  .status-msg {
    font-size: 0.65rem;
    margin-top: 8px;
    text-align: center;
    min-height: 1em;
  }
  .status-ok { color: #4caf50; }
  .status-err { color: #ff4444; }
  .info-row {
    display: flex;
    justify-content: space-between;
    font-size: 0.6rem;
    color: var(--dim);
    padding: 4px 0;
  }
  .wifi-row {
    display: flex;
    gap: 8px;
    align-items: center;
  }
  select, input[type=password] {
    width: 100%;
    background: #1a1a2a;
    color: var(--text);
    border: 1px solid var(--border);
    border-radius: 8px;
    padding: 8px;
    font-family: inherit;
    font-size: 0.7rem;
  }
  .mini-btn {
    padding: 8px 10px;
    font-family: inherit;
    font-size: 0.65rem;
    background: #1a1a2a;
    color: var(--text);
    border: 1px solid var(--border);
    border-radius: 8px;
    cursor: pointer;
    white-space: nowrap;
  }
  .mini-btn:hover { border-color: var(--accent); }
</style>
</head>
<body>
<div class="container">
  <h1>&#9670; LED Controller</h1>
  <div class="led-preview" id="preview"></div>

  <!-- Power & Brightness -->
  <div class="card">
    <div class="power-row">
      <span class="card-title" style="margin:0">POWER</span>
      <div class="toggle on" id="powerToggle" onclick="togglePower()"></div>
    </div>
  </div>

  <div class="card">
    <div class="card-title">BRIGHTNESS</div>
    <div class="slider-group">
      <div class="slider-label"><span>Dim</span><span id="brVal">128</span><span>Full</span></div>
      <input type="range" id="brightness" min="0" max="255" value="128" oninput="sendSlider('brightness',this.value)">
    </div>
    <div class="card-title" style="margin-top:8px">SPEED</div>
    <div class="slider-group">
      <div class="slider-label"><span>Slow</span><span id="spVal">128</span><span>Fast</span></div>
      <input type="range" id="speed" min="1" max="255" value="128" oninput="sendSlider('speed',this.value)">
    </div>
  </div>

