noless-zz/esp8266-led-strip-clock/src/main.cpp
  <!-- Colors -->
  <div class="card">
    <div class="card-title">COLORS</div>
    <div class="color-row">
      <div class="color-pick">
        <label>PRIMARY</label>
        <input type="color" id="color1" value="#ff0050" onchange="sendColor()">
      </div>
      <div class="color-pick">
        <label>SECONDARY</label>
        <input type="color" id="color2" value="#0078ff" onchange="sendColor()">
      </div>
    </div>
  </div>

  <!-- Effects -->
  <div class="card">
    <div class="card-title">EFFECTS</div>
    <div class="effects-grid" id="fxGrid">
      <button class="fx-btn active" onclick="setEffect(0)">Solid</button>
      <button class="fx-btn" onclick="setEffect(1)">Rainbow</button>
      <button class="fx-btn" onclick="setEffect(2)">Chase</button>
      <button class="fx-btn" onclick="setEffect(3)">Breathe</button>
      <button class="fx-btn" onclick="setEffect(4)">Fire</button>
      <button class="fx-btn" onclick="setEffect(5)">Twinkle</button>
      <button class="fx-btn" onclick="setEffect(6)">Wave</button>
      <button class="fx-btn" onclick="setEffect(7)">Gradient</button>
    </div>
  </div>

  <!-- WiFi Setup -->
  <div class="card">
    <div class="card-title">WIFI SETUP</div>
    <div class="wifi-row" style="margin-bottom:8px">
      <select id="ssidList"></select>
      <button class="mini-btn" onclick="scanWifi()">SCAN</button>
    </div>
    <div class="wifi-row">
      <input type="password" id="wifiPass" placeholder="WiFi password">
      <button class="mini-btn" onclick="connectWifi()">CONNECT</button>
    </div>
    <div class="status-msg" id="wifiMsg"></div>
  </div>

  <!-- OTA Update -->
  <div class="card">
    <div class="card-title">FIRMWARE UPDATE</div>
    <div class="upload-area" onclick="document.getElementById('fwFile').click()">
      <p id="fileName">Select .bin firmware file</p>
      <input type="file" id="fwFile" accept=".bin" style="display:none" onchange="fileSelected(this)">
    </div>
    <button class="upload-btn" id="uploadBtn" onclick="uploadFirmware()" disabled>UPLOAD</button>
    <div class="progress-bar" id="progBar"><div class="progress-fill" id="progFill"></div></div>
    <div class="status-msg" id="statusMsg"></div>
  </div>

  <!-- Info -->
  <div class="card">
    <div class="card-title">DEVICE INFO</div>
    <div class="info-row"><span>LEDs</span><span>65</span></div>
    <div class="info-row"><span>AP SSID</span><span id="apSsid">-</span></div>
    <div class="info-row"><span>Host</span><span id="host">-</span></div>
    <div class="info-row"><span>IP</span><span id="ip">-</span></div>
    <div class="info-row"><span>Heap</span><span id="heap">-</span></div>
  </div>
</div>

<script>
const API = '';
let debounce = null;

function send(url) {
  fetch(API + url).catch(e => console.warn(e));
}

function togglePower() {
  const t = document.getElementById('powerToggle');
  t.classList.toggle('on');
  send('/api/power?on=' + (t.classList.contains('on') ? '1' : '0'));
}

function sendSlider(param, val) {
  document.getElementById(param === 'brightness' ? 'brVal' : 'spVal').textContent = val;
  clearTimeout(debounce);
  debounce = setTimeout(() => send('/api/' + param + '?value=' + val), 50);
}

function sendColor() {
  const c1 = document.getElementById('color1').value;
  const c2 = document.getElementById('color2').value;
  send('/api/color?c1=' + encodeURIComponent(c1) + '&c2=' + encodeURIComponent(c2));
}

function setEffect(idx) {
  document.querySelectorAll('.fx-btn').forEach((b, i) => b.classList.toggle('active', i === idx));
  send('/api/effect?id=' + idx);
}

function fileSelected(input) {
  if (input.files.length > 0) {
    document.getElementById('fileName').textContent = input.files[0].name;
    document.getElementById('uploadBtn').disabled = false;
  }
}

function uploadFirmware() {
  const file = document.getElementById('fwFile').files[0];
  if (!file) return;
  const formData = new FormData();
  formData.append('firmware', file);
  const xhr = new XMLHttpRequest();
  const progBar = document.getElementById('progBar');
  const progFill = document.getElementById('progFill');
  const statusMsg = document.getElementById('statusMsg');
  progBar.style.display = 'block';
  statusMsg.textContent = '';
  statusMsg.className = 'status-msg';
  document.getElementById('uploadBtn').disabled = true;

  xhr.upload.addEventListener('progress', (e) => {
    if (e.lengthComputable) progFill.style.width = (e.loaded / e.total * 100) + '%';
  });
  xhr.addEventListener('load', () => {
    if (xhr.status === 200) {
      statusMsg.textContent = 'Update OK! Rebooting...';
      statusMsg.className = 'status-msg status-ok';
      setTimeout(() => location.reload(), 5000);
    } else {
      statusMsg.textContent = 'Upload failed: ' + xhr.responseText;
      statusMsg.className = 'status-msg status-err';
      document.getElementById('uploadBtn').disabled = false;
    }
  });
  xhr.addEventListener('error', () => {
    statusMsg.textContent = 'Connection error';
    statusMsg.className = 'status-msg status-err';
    document.getElementById('uploadBtn').disabled = false;
  });
  xhr.open('POST', '/api/update');
  xhr.send(formData);
}

function scanWifi(attempt = 0) {
  const list = document.getElementById('ssidList');
  const msg = document.getElementById('wifiMsg');
  if (attempt === 0) {
    msg.textContent = 'Scanning...';
    msg.className = 'status-msg';
  }
  fetch('/api/wifi/scan').then(r => r.json()).then(d => {
    if (d.scanning) {
      if (attempt > 25) {
        msg.textContent = 'Scan timeout';
        msg.className = 'status-msg status-err';
        return;
      }
      setTimeout(() => scanWifi(attempt + 1), 350);
      return;
    }

    list.innerHTML = '';
    if (!d.networks || d.networks.length === 0) {
      const opt = document.createElement('option');
      opt.value = '';
      opt.textContent = 'No networks found';
      list.appendChild(opt);
      msg.textContent = 'No SSIDs detected';
      return;
    }
    d.networks.forEach(n => {
      const opt = document.createElement('option');
      opt.value = n.ssid;
      opt.textContent = `${n.ssid} (${n.rssi} dBm)`;
      list.appendChild(opt);
    });
    msg.textContent = `Found ${d.networks.length} networks`;
    msg.className = 'status-msg status-ok';
  }).catch(() => {
    msg.textContent = 'Scan failed';
    msg.className = 'status-msg status-err';
  });
}

