noless-zz/esp8266-led-strip-clock/src/main.cpp
void effectTwinkle() {
  fadeToBlackBy(leds, NUM_LEDS, 20);
  if (random8() < 80) {
    int pos = random16(NUM_LEDS);
    leds[pos] = random8() > 128 ? state.color1 : state.color2;
  }
}

void effectWave() {
  for (int i = 0; i < NUM_LEDS; i++) {
    uint8_t wave = sin8(i * 10 + effectHue);
    leds[i] = blend(state.color1, state.color2, wave);
  }
  effectHue += 2;
}

void effectGradient() {
  fill_gradient_RGB(leds, 0, state.color1, NUM_LEDS - 1, state.color2);
}

// ─── Status JSON ─────────────────────────────────────────
String getStatusJson() {
  JsonDocument doc;
  doc["power"]      = state.power;
  doc["brightness"] = state.brightness;
  doc["effect"]     = state.effect;
  doc["speed"]      = state.speed;
  doc["heap"]       = ESP.getFreeHeap();
  doc["ap_ssid"]    = apSsid;
  doc["hostname"]   = localHostname;
  doc["connected"]  = WiFi.status() == WL_CONNECTED;
  doc["ip"]         = WiFi.status() == WL_CONNECTED ? WiFi.localIP().toString() : WiFi.softAPIP().toString();
  char c1[8], c2[8];
  snprintf(c1, sizeof(c1), "#%02x%02x%02x", state.color1.r, state.color1.g, state.color1.b);
  snprintf(c2, sizeof(c2), "#%02x%02x%02x", state.color2.r, state.color2.g, state.color2.b);
  doc["color1"] = c1;
  doc["color2"] = c2;
  String out;
  serializeJson(doc, out);
  return out;
}

String getWifiScanJson() {
  JsonDocument doc;
  JsonArray arr = doc["networks"].to<JsonArray>();

  int scanState = WiFi.scanComplete();

  if (scanState == WIFI_SCAN_RUNNING) {
    doc["scanning"] = true;
  } else if (scanState == WIFI_SCAN_FAILED) {
    WiFi.scanDelete();
    WiFi.scanNetworks(true, true);
    doc["scanning"] = true;
  } else {
    doc["scanning"] = false;
    for (int i = 0; i < scanState; i++) {
      String ssid = WiFi.SSID(i);
      if (ssid.length() == 0) continue;
      JsonObject obj = arr.add<JsonObject>();
      obj["ssid"] = ssid;
      obj["rssi"] = WiFi.RSSI(i);
      obj["enc"]  = (WiFi.encryptionType(i) != ENC_TYPE_NONE);
    }
    WiFi.scanDelete();
    if (scanState <= 0) {
      WiFi.scanNetworks(true, true);
      doc["scanning"] = true;
    }
  }

  String out;
  serializeJson(doc, out);
  return out;
}

bool connectToWiFi(const String& ssid, const String& pass) {
  if (ssid.length() == 0) {
    return false;
  }

  WiFi.mode(WIFI_AP_STA);
  WiFi.hostname(localHostname.c_str());
  WiFi.begin(ssid.c_str(), pass.c_str());
  Serial.println("Connecting to SSID: " + ssid);

  unsigned long started = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - started < 15000) {
    delay(250);
  }

  if (WiFi.status() == WL_CONNECTED) {
    WiFi.softAPdisconnect(true);
    WiFi.mode(WIFI_STA);
    dnsServer.stop();
    setupMDNS();
    Serial.print("WiFi connected. IP: ");
    Serial.println(WiFi.localIP());
    return true;
  }
  Serial.println("WiFi connect failed");
  return false;
}

// ─── Parse hex color ─────────────────────────────────────
CRGB parseHexColor(const String& hex) {
  String h = hex;
  if (h.startsWith("#")) h = h.substring(1);
  long val = strtol(h.c_str(), NULL, 16);
  return CRGB((val >> 16) & 0xFF, (val >> 8) & 0xFF, val & 0xFF);
}

// ─── Web Server ──────────────────────────────────────────
void setupWebServer() {
  // ── Captive portal detection endpoints ──
  // Android
  server.on("/generate_204", HTTP_GET, [](AsyncWebServerRequest *req) {
    req->redirect("http://192.168.4.1/");
  });
  server.on("/gen_204", HTTP_GET, [](AsyncWebServerRequest *req) {
    req->redirect("http://192.168.4.1/");
  });
  // Apple
  server.on("/hotspot-detect.html", HTTP_GET, [](AsyncWebServerRequest *req) {
    req->redirect("http://192.168.4.1/");
  });
  server.on("/library/test/success.html", HTTP_GET, [](AsyncWebServerRequest *req) {
    req->redirect("http://192.168.4.1/");
  });
  // Microsoft
  server.on("/connecttest.txt", HTTP_GET, [](AsyncWebServerRequest *req) {
    req->redirect("http://192.168.4.1/");
  });
  server.on("/ncsi.txt", HTTP_GET, [](AsyncWebServerRequest *req) {
    req->redirect("http://192.168.4.1/");
  });
  // Firefox
  server.on("/canonical.html", HTTP_GET, [](AsyncWebServerRequest *req) {
    req->redirect("http://192.168.4.1/");
  });

  // ── Main page ──
  server.on("/", HTTP_GET, [](AsyncWebServerRequest *req) {
    req->send_P(200, "text/html", INDEX_HTML);
  });

  // ── API Endpoints ──
  server.on("/api/status", HTTP_GET, [](AsyncWebServerRequest *req) {
    req->send(200, "application/json", getStatusJson());
  });

  server.on("/api/power", HTTP_GET, [](AsyncWebServerRequest *req) {
    if (req->hasParam("on")) {
      state.power = req->getParam("on")->value() == "1";
    }
    req->send(200, "application/json", getStatusJson());
  });

  server.on("/api/brightness", HTTP_GET, [](AsyncWebServerRequest *req) {
    if (req->hasParam("value")) {
      state.brightness = req->getParam("value")->value().toInt();
      FastLED.setBrightness(state.brightness);
    }
    req->send(200, "application/json", getStatusJson());
  });

  server.on("/api/speed", HTTP_GET, [](AsyncWebServerRequest *req) {
    if (req->hasParam("value")) {
      state.speed = req->getParam("value")->value().toInt();
    }
    req->send(200, "application/json", getStatusJson());
  });

  server.on("/api/effect", HTTP_GET, [](AsyncWebServerRequest *req) {
    if (req->hasParam("id")) {
      state.effect = req->getParam("id")->value().toInt();
    }
    req->send(200, "application/json", getStatusJson());
  });

  server.on("/api/color", HTTP_GET, [](AsyncWebServerRequest *req) {
    if (req->hasParam("c1")) {
      state.color1 = parseHexColor(req->getParam("c1")->value());
    }
    if (req->hasParam("c2")) {
      state.color2 = parseHexColor(req->getParam("c2")->value());
    }
    req->send(200, "application/json", getStatusJson());
  });

  server.on("/api/wifi/scan", HTTP_GET, [](AsyncWebServerRequest *req) {
    req->send(200, "application/json", getWifiScanJson());
  });

  server.on("/api/wifi/connect", HTTP_GET, [](AsyncWebServerRequest *req) {
    if (!req->hasParam("ssid")) {
      req->send(400, "application/json", "{\"connected\":false,\"error\":\"Missing SSID\"}");
      return;
    }
    String ssid = req->getParam("ssid")->value();
    String pass = req->hasParam("pass") ? req->getParam("pass")->value() : "";
    bool ok = connectToWiFi(ssid, pass);

    JsonDocument doc;
    doc["connected"] = ok;
    doc["hostname"] = localHostname;
    doc["ip"] = ok ? WiFi.localIP().toString() : "";
    if (!ok) doc["error"] = "Could not connect. Check password/signal.";
    String out;
    serializeJson(doc, out);
    req->send(ok ? 200 : 500, "application/json", out);
  });

