noless-zz/esp8266-led-strip-clock/src/main.cpp
  // ── Firmware Update (HTTP) ──
  server.on("/api/update", HTTP_POST,
    // Response handler
    [](AsyncWebServerRequest *req) {
      bool success = !Update.hasError();
      AsyncWebServerResponse *resp = req->beginResponse(
        success ? 200 : 500,
        "text/plain",
        success ? "OK - Rebooting..." : "Update Failed"
      );
      resp->addHeader("Connection", "close");
      req->send(resp);
      if (success) {
        delay(500);
        ESP.restart();
      }
    },
    // Upload handler
    [](AsyncWebServerRequest *req, String filename, size_t index, uint8_t *data, size_t len, bool final) {
      if (index == 0) {
        Serial.printf("Update: %s (%u bytes)\n", filename.c_str(), req->contentLength());
        // Disable LEDs during update
        FastLED.clear(true);
        uint32_t maxSize = (ESP.getFreeSketchSpace() - 0x1000) & 0xFFFFF000;
        if (!Update.begin(maxSize, U_FLASH)) {
          Update.printError(Serial);
        }
      }
      if (!Update.hasError()) {
        if (Update.write(data, len) != len) {
          Update.printError(Serial);
        }
        // Show progress on LEDs
        if (req->contentLength() > 0) {
          int pct = (index + len) * 100 / req->contentLength();
          int litLeds = map(pct, 0, 100, 0, NUM_LEDS);
          FastLED.clear();
          for (int i = 0; i < litLeds; i++) leds[i] = CRGB::Blue;
          FastLED.show();
        }
      }
      if (final) {
        if (Update.end(true)) {
          Serial.printf("Update OK: %u bytes\n", index + len);
          fill_solid(leds, NUM_LEDS, CRGB::Green);
          FastLED.show();
        } else {
          Update.printError(Serial);
          fill_solid(leds, NUM_LEDS, CRGB::Red);
          FastLED.show();
        }
      }
    }
  );

  // ── Catch-all for captive portal ──
  server.onNotFound([](AsyncWebServerRequest *req) {
    req->redirect("http://192.168.4.1/");
  });

  server.begin();
  Serial.println("HTTP server started");
}
